luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G4_RES11.
* To use register names with standard convension, please use VADC_G4_RES11.
*/
#define	VADC_G4RES11	(VADC_G4_RES11)

/** \brief  1730, Group Result Register */
#define VADC_G4_RES12 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021730u)

/** Alias (User Manual Name) for VADC_G4_RES12.
* To use register names with standard convension, please use VADC_G4_RES12.
*/
#define	VADC_G4RES12	(VADC_G4_RES12)

/** \brief  1734, Group Result Register */
#define VADC_G4_RES13 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021734u)

/** Alias (User Manual Name) for VADC_G4_RES13.
* To use register names with standard convension, please use VADC_G4_RES13.
*/
#define	VADC_G4RES13	(VADC_G4_RES13)

/** \brief  1738, Group Result Register */
#define VADC_G4_RES14 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021738u)

/** Alias (User Manual Name) for VADC_G4_RES14.
* To use register names with standard convension, please use VADC_G4_RES14.
*/
#define	VADC_G4RES14	(VADC_G4_RES14)

/** \brief  173C, Group Result Register */
#define VADC_G4_RES15 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF002173Cu)

/** Alias (User Manual Name) for VADC_G4_RES15.
* To use register names with standard convension, please use VADC_G4_RES15.
*/
#define	VADC_G4RES15	(VADC_G4_RES15)

/** \brief  1708, Group Result Register */
#define VADC_G4_RES2 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021708u)

/** Alias (User Manual Name) for VADC_G4_RES2.
* To use register names with standard convension, please use VADC_G4_RES2.
*/
#define	VADC_G4RES2	(VADC_G4_RES2)

/** \brief  170C, Group Result Register */
#define VADC_G4_RES3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF002170Cu)

/** Alias (User Manual Name) for VADC_G4_RES3.
* To use register names with standard convension, please use VADC_G4_RES3.
*/
#define	VADC_G4RES3	(VADC_G4_RES3)

/** \brief  1710, Group Result Register */
#define VADC_G4_RES4 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021710u)

/** Alias (User Manual Name) for VADC_G4_RES4.
* To use register names with standard convension, please use VADC_G4_RES4.
*/
#define	VADC_G4RES4	(VADC_G4_RES4)

/** \brief  1714, Group Result Register */
#define VADC_G4_RES5 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021714u)

/** Alias (User Manual Name) for VADC_G4_RES5.
* To use register names with standard convension, please use VADC_G4_RES5.
*/
#define	VADC_G4RES5	(VADC_G4_RES5)

/** \brief  1718, Group Result Register */
#define VADC_G4_RES6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021718u)

/** Alias (User Manual Name) for VADC_G4_RES6.
* To use register names with standard convension, please use VADC_G4_RES6.
*/
#define	VADC_G4RES6	(VADC_G4_RES6)

/** \brief  171C, Group Result Register */
#define VADC_G4_RES7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF002171Cu)

/** Alias (User Manual Name) for VADC_G4_RES7.
* To use register names with standard convension, please use VADC_G4_RES7.
*/
#define	VADC_G4RES7	(VADC_G4_RES7)

/** \brief  1720, Group Result Register */
#define VADC_G4_RES8 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021720u)

/** Alias (User Manual Name) for VADC_G4_RES8.
* To use register names with standard convension, please use VADC_G4_RES8.
*/
#define	VADC_G4RES8	(VADC_G4_RES8)

/** \brief  1724, Group Result Register */
#define VADC_G4_RES9 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021724u)

/** Alias (User Manual Name) for VADC_G4_RES9.
* To use register names with standard convension, please use VADC_G4_RES9.
*/
#define	VADC_G4RES9	(VADC_G4_RES9)

/** \brief  1780, Group Result Reg., Debug */
#define VADC_G4_RESD0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021780u)

/** Alias (User Manual Name) for VADC_G4_RESD0.
* To use register names with standard convension, please use VADC_G4_RESD0.
*/
#define	VADC_G4RESD0	(VADC_G4_RESD0)

/** \brief  1784, Group Result Reg., Debug */
#define VADC_G4_RESD1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021784u)

/** Alias (User Manual Name) for VADC_G4_RESD1.
* To use register names with standard convension, please use VADC_G4_RESD1.
*/
#define	VADC_G4RESD1	(VADC_G4_RESD1)

/** \brief  17A8, Group Result Reg., Debug */
#define VADC_G4_RESD10 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00217A8u)

/** Alias (User Manual Name) for VADC_G4_RESD10.
* To use register names with standard convension, please use VADC_G4_RESD10.
*/
#define	VADC_G4RESD10	(VADC_G4_RESD10)

/** \brief  17AC, Group Result Reg., Debug */
#define VADC_G4_RESD11 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00217ACu)

/** Alias (User Manual Name) for VADC_G4_RESD11.
* To use register names with standard convension, please use VADC_G4_RESD11.
*/
#define	VADC_G4RESD11	(VADC_G4_RESD11)

/** \brief  17B0, Group Result Reg., Debug */
#define VADC_G4_RESD12 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00217B0u)

/** Alias (User Manual Name) for VADC_G4_RESD12.
* To use register names with standard convension, please use VADC_G4_RESD12.
*/
#define	VADC_G4RESD12	(VADC_G4_RESD12)

/** \brief  17B4, Group Result Reg., Debug */
#define VADC_G4_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00217B4u)

/** Alias (User Manual Name) for VADC_G4_RESD13.
* To use register names with standard convension, please use VADC_G4_RESD13.
*/
#define	VADC_G4RESD13	(VADC_G4_RESD13)

/** \brief  17B8, Group Result Reg., Debug */
#define VADC_G4_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00217B8u)

/** Alias (User Manual Name) for VADC_G4_RESD14.
* To use register names with standard convension, please use VADC_G4_RESD14.
*/
#define	VADC_G4RESD14	(VADC_G4_RESD14)

/** \brief  17BC, Group Result Reg., Debug */
#define VADC_G4_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00217BCu)

/** Alias (User Manual Name) for VADC_G4_RESD15.
* To use register names with standard convension, please use VADC_G4_RESD15.
*/
#define	VADC_G4RESD15	(VADC_G4_RESD15)

/** \brief  1788, Group Result Reg., Debug */
#define VADC_G4_RESD2 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021788u)

