luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G4_RESD2.
* To use register names with standard convension, please use VADC_G4_RESD2.
*/
#define	VADC_G4RESD2	(VADC_G4_RESD2)

/** \brief  178C, Group Result Reg., Debug */
#define VADC_G4_RESD3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF002178Cu)

/** Alias (User Manual Name) for VADC_G4_RESD3.
* To use register names with standard convension, please use VADC_G4_RESD3.
*/
#define	VADC_G4RESD3	(VADC_G4_RESD3)

/** \brief  1790, Group Result Reg., Debug */
#define VADC_G4_RESD4 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021790u)

/** Alias (User Manual Name) for VADC_G4_RESD4.
* To use register names with standard convension, please use VADC_G4_RESD4.
*/
#define	VADC_G4RESD4	(VADC_G4_RESD4)

/** \brief  1794, Group Result Reg., Debug */
#define VADC_G4_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021794u)

/** Alias (User Manual Name) for VADC_G4_RESD5.
* To use register names with standard convension, please use VADC_G4_RESD5.
*/
#define	VADC_G4RESD5	(VADC_G4_RESD5)

/** \brief  1798, Group Result Reg., Debug */
#define VADC_G4_RESD6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021798u)

/** Alias (User Manual Name) for VADC_G4_RESD6.
* To use register names with standard convension, please use VADC_G4_RESD6.
*/
#define	VADC_G4RESD6	(VADC_G4_RESD6)

/** \brief  179C, Group Result Reg., Debug */
#define VADC_G4_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF002179Cu)

/** Alias (User Manual Name) for VADC_G4_RESD7.
* To use register names with standard convension, please use VADC_G4_RESD7.
*/
#define	VADC_G4RESD7	(VADC_G4_RESD7)

/** \brief  17A0, Group Result Reg., Debug */
#define VADC_G4_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00217A0u)

/** Alias (User Manual Name) for VADC_G4_RESD8.
* To use register names with standard convension, please use VADC_G4_RESD8.
*/
#define	VADC_G4RESD8	(VADC_G4_RESD8)

/** \brief  17A4, Group Result Reg., Debug */
#define VADC_G4_RESD9 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00217A4u)

/** Alias (User Manual Name) for VADC_G4_RESD9.
* To use register names with standard convension, please use VADC_G4_RESD9.
*/
#define	VADC_G4RESD9	(VADC_G4_RESD9)

/** \brief  15B0, Result Event Node Pointer Register 0, Group */
#define VADC_G4_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF00215B0u)

/** Alias (User Manual Name) for VADC_G4_REVNP0.
* To use register names with standard convension, please use VADC_G4_REVNP0.
*/
#define	VADC_G4REVNP0	(VADC_G4_REVNP0)

/** \brief  15B4, Result Event Node Pointer Register 1, Group */
#define VADC_G4_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF00215B4u)

/** Alias (User Manual Name) for VADC_G4_REVNP1.
* To use register names with standard convension, please use VADC_G4_REVNP1.
*/
#define	VADC_G4REVNP1	(VADC_G4_REVNP1)

/** \brief  148C, Result Assignment Register, Group */
#define VADC_G4_RRASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RRASS*)0xF002148Cu)

/** Alias (User Manual Name) for VADC_G4_RRASS.
* To use register names with standard convension, please use VADC_G4_RRASS.
*/
#define	VADC_G4RRASS	(VADC_G4_RRASS)

/** \brief  1598, Source Event Flag Clear Register, Group */
#define VADC_G4_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0021598u)

/** Alias (User Manual Name) for VADC_G4_SEFCLR.
* To use register names with standard convension, please use VADC_G4_SEFCLR.
*/
#define	VADC_G4SEFCLR	(VADC_G4_SEFCLR)

/** \brief  1588, Source Event Flag Register, Group */
#define VADC_G4_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0021588u)

/** Alias (User Manual Name) for VADC_G4_SEFLAG.
* To use register names with standard convension, please use VADC_G4_SEFLAG.
*/
#define	VADC_G4SEFLAG	(VADC_G4_SEFLAG)

/** \brief  15C0, Source Event Node Pointer Register, Group */
#define VADC_G4_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF00215C0u)

/** Alias (User Manual Name) for VADC_G4_SEVNP.
* To use register names with standard convension, please use VADC_G4_SEVNP.
*/
#define	VADC_G4SEVNP	(VADC_G4_SEVNP)

/** \brief  15C8, Service Request Software Activation Trigger, Group */
#define VADC_G4_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF00215C8u)

/** Alias (User Manual Name) for VADC_G4_SRACT.
* To use register names with standard convension, please use VADC_G4_SRACT.
*/
#define	VADC_G4SRACT	(VADC_G4_SRACT)

/** \brief  14C0, Synchronization Control Register, Group */
#define VADC_G4_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF00214C0u)

/** Alias (User Manual Name) for VADC_G4_SYNCTR.
* To use register names with standard convension, please use VADC_G4_SYNCTR.
*/
#define	VADC_G4SYNCTR	(VADC_G4_SYNCTR)

/** \brief  15F8, Valid Flag Register, Group */
#define VADC_G4_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF00215F8u)

/** Alias (User Manual Name) for VADC_G4_VFR.
* To use register names with standard convension, please use VADC_G4_VFR.
*/
#define	VADC_G4VFR	(VADC_G4_VFR)

/** \brief  18B0, Alias Register, Group */
#define VADC_G5_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF00218B0u)

/** Alias (User Manual Name) for VADC_G5_ALIAS.
* To use register names with standard convension, please use VADC_G5_ALIAS.
*/
#define	VADC_G5ALIAS	(VADC_G5_ALIAS)

/** \brief  1880, Arbitration Configuration Register, Group */
#define VADC_G5_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0021880u)

/** Alias (User Manual Name) for VADC_G5_ARBCFG.
* To use register names with standard convension, please use VADC_G5_ARBCFG.
*/
#define	VADC_G5ARBCFG	(VADC_G5_ARBCFG)

/** \brief  1884, Arbitration Priority Register, Group */
#define VADC_G5_ARBPR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBPR*)0xF0021884u)

/** Alias (User Manual Name) for VADC_G5_ARBPR.
* To use register names with standard convension, please use VADC_G5_ARBPR.
*/
#define	VADC_G5ARBPR	(VADC_G5_ARBPR)

/** \brief  1920, Autoscan Source Control Register, Group */
#define VADC_G5_ASCTRL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASCTRL*)0xF0021920u)

/** Alias (User Manual Name) for VADC_G5_ASCTRL.
* To use register names with standard convension, please use VADC_G5_ASCTRL.
*/
#define	VADC_G5ASCTRL	(VADC_G5_ASCTRL)

