luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** \brief  1924, Autoscan Source Mode Register, Group */
#define VADC_G5_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0021924u)

/** Alias (User Manual Name) for VADC_G5_ASMR.
* To use register names with standard convension, please use VADC_G5_ASMR.
*/
#define	VADC_G5ASMR	(VADC_G5_ASMR)

/** \brief  192C, Autoscan Source Pending Register, Group */
#define VADC_G5_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF002192Cu)

/** Alias (User Manual Name) for VADC_G5_ASPND.
* To use register names with standard convension, please use VADC_G5_ASPND.
*/
#define	VADC_G5ASPND	(VADC_G5_ASPND)

/** \brief  1928, Autoscan Source Channel Select Register, Group */
#define VADC_G5_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0021928u)

/** Alias (User Manual Name) for VADC_G5_ASSEL.
* To use register names with standard convension, please use VADC_G5_ASSEL.
*/
#define	VADC_G5ASSEL	(VADC_G5_ASSEL)

/** \brief  18C8, Boundary Flag Register, Group */
#define VADC_G5_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF00218C8u)

/** Alias (User Manual Name) for VADC_G5_BFL.
* To use register names with standard convension, please use VADC_G5_BFL.
*/
#define	VADC_G5BFL	(VADC_G5_BFL)

/** \brief  18D0, Boundary Flag Control Register, Group */
#define VADC_G5_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF00218D0u)

/** Alias (User Manual Name) for VADC_G5_BFLC.
* To use register names with standard convension, please use VADC_G5_BFLC.
*/
#define	VADC_G5BFLC	(VADC_G5_BFLC)

/** \brief  18D4, Boundary Flag Node Pointer Register, Group */
#define VADC_G5_BFLNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLNP*)0xF00218D4u)

/** Alias (User Manual Name) for VADC_G5_BFLNP.
* To use register names with standard convension, please use VADC_G5_BFLNP.
*/
#define	VADC_G5BFLNP	(VADC_G5_BFLNP)

/** \brief  18CC, Boundary Flag Software Register, Group */
#define VADC_G5_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF00218CCu)

/** Alias (User Manual Name) for VADC_G5_BFLS.
* To use register names with standard convension, please use VADC_G5_BFLS.
*/
#define	VADC_G5BFLS	(VADC_G5_BFLS)

/** \brief  18B8, Boundary Select Register, Group */
#define VADC_G5_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF00218B8u)

/** Alias (User Manual Name) for VADC_G5_BOUND.
* To use register names with standard convension, please use VADC_G5_BOUND.
*/
#define	VADC_G5BOUND	(VADC_G5_BOUND)

/** \brief  1990, Channel Event Flag Clear Register, Group */
#define VADC_G5_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0021990u)

/** Alias (User Manual Name) for VADC_G5_CEFCLR.
* To use register names with standard convension, please use VADC_G5_CEFCLR.
*/
#define	VADC_G5CEFCLR	(VADC_G5_CEFCLR)

/** \brief  1980, Channel Event Flag Register, Group */
#define VADC_G5_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0021980u)

/** Alias (User Manual Name) for VADC_G5_CEFLAG.
* To use register names with standard convension, please use VADC_G5_CEFLAG.
*/
#define	VADC_G5CEFLAG	(VADC_G5_CEFLAG)

/** \brief  19A0, Channel Event Node Pointer Register 0, Group */
#define VADC_G5_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF00219A0u)

/** Alias (User Manual Name) for VADC_G5_CEVNP0.
* To use register names with standard convension, please use VADC_G5_CEVNP0.
*/
#define	VADC_G5CEVNP0	(VADC_G5_CEVNP0)

/** \brief  1888, Channel Assignment Register, Group */
#define VADC_G5_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0021888u)

/** Alias (User Manual Name) for VADC_G5_CHASS.
* To use register names with standard convension, please use VADC_G5_CHASS.
*/
#define	VADC_G5CHASS	(VADC_G5_CHASS)

/** \brief  1A00, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0021A00u)

/** Alias (User Manual Name) for VADC_G5_CHCTR0.
* To use register names with standard convension, please use VADC_G5_CHCTR0.
*/
#define	VADC_G5CHCTR0	(VADC_G5_CHCTR0)

/** \brief  1A04, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0021A04u)

/** Alias (User Manual Name) for VADC_G5_CHCTR1.
* To use register names with standard convension, please use VADC_G5_CHCTR1.
*/
#define	VADC_G5CHCTR1	(VADC_G5_CHCTR1)

/** \brief  1A08, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0021A08u)

/** Alias (User Manual Name) for VADC_G5_CHCTR2.
* To use register names with standard convension, please use VADC_G5_CHCTR2.
*/
#define	VADC_G5CHCTR2	(VADC_G5_CHCTR2)

/** \brief  1A0C, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0021A0Cu)

/** Alias (User Manual Name) for VADC_G5_CHCTR3.
* To use register names with standard convension, please use VADC_G5_CHCTR3.
*/
#define	VADC_G5CHCTR3	(VADC_G5_CHCTR3)

/** \brief  1A10, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0021A10u)

/** Alias (User Manual Name) for VADC_G5_CHCTR4.
* To use register names with standard convension, please use VADC_G5_CHCTR4.
*/
#define	VADC_G5CHCTR4	(VADC_G5_CHCTR4)

/** \brief  1A14, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0021A14u)

/** Alias (User Manual Name) for VADC_G5_CHCTR5.
* To use register names with standard convension, please use VADC_G5_CHCTR5.
*/
#define	VADC_G5CHCTR5	(VADC_G5_CHCTR5)

/** \brief  1A18, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0021A18u)

/** Alias (User Manual Name) for VADC_G5_CHCTR6.
* To use register names with standard convension, please use VADC_G5_CHCTR6.
*/
#define	VADC_G5CHCTR6	(VADC_G5_CHCTR6)

/** \brief  1A1C, Group, Channel Ctrl. Reg. */
#define VADC_G5_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0021A1Cu)

/** Alias (User Manual Name) for VADC_G5_CHCTR7.
* To use register names with standard convension, please use VADC_G5_CHCTR7.
*/
#define	VADC_G5CHCTR7	(VADC_G5_CHCTR7)

