luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** \brief  19F0, External Multiplexer Control Register, Group x */
#define VADC_G5_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00219F0u)

/** Alias (User Manual Name) for VADC_G5_EMUXCTR.
* To use register names with standard convension, please use VADC_G5_EMUXCTR.
*/
#define	VADC_G5EMUXCTR	(VADC_G5_EMUXCTR)

/** \brief  18A0, Input Class Register */
#define VADC_G5_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00218A0u)

/** Alias (User Manual Name) for VADC_G5_ICLASS0.
* To use register names with standard convension, please use VADC_G5_ICLASS0.
*/
#define	VADC_G5ICLASS0	(VADC_G5_ICLASS0)

/** \brief  18A4, Input Class Register */
#define VADC_G5_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00218A4u)

/** Alias (User Manual Name) for VADC_G5_ICLASS1.
* To use register names with standard convension, please use VADC_G5_ICLASS1.
*/
#define	VADC_G5ICLASS1	(VADC_G5_ICLASS1)

/** \brief  190C, Queue 0 Register 0, Group */
#define VADC_G5_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF002190Cu)

/** Alias (User Manual Name) for VADC_G5_Q0R0.
* To use register names with standard convension, please use VADC_G5_Q0R0.
*/
#define	VADC_G5Q0R0	(VADC_G5_Q0R0)

/** \brief  1910, Queue 0 Input Register, Group */
#define VADC_G5_QBUR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR0*)0xF0021910u)

/** Alias (User Manual Name) for VADC_G5_QBUR0.
* To use register names with standard convension, please use VADC_G5_QBUR0.
*/
#define	VADC_G5QBUR0	(VADC_G5_QBUR0)

/** \brief  1900, Queue 0 Source Control Register, Group */
#define VADC_G5_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0021900u)

/** Alias (User Manual Name) for VADC_G5_QCTRL0.
* To use register names with standard convension, please use VADC_G5_QCTRL0.
*/
#define	VADC_G5QCTRL0	(VADC_G5_QCTRL0)

/** \brief  1910, Queue 0 Input Register, Group */
#define VADC_G5_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QINR0*)0xF0021910u)

/** Alias (User Manual Name) for VADC_G5_QINR0.
* To use register names with standard convension, please use VADC_G5_QINR0.
*/
#define	VADC_G5QINR0	(VADC_G5_QINR0)

/** \brief  1904, Queue 0 Mode Register, Group */
#define VADC_G5_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0021904u)

/** Alias (User Manual Name) for VADC_G5_QMR0.
* To use register names with standard convension, please use VADC_G5_QMR0.
*/
#define	VADC_G5QMR0	(VADC_G5_QMR0)

/** \brief  1908, Queue 0 Status Register, Group */
#define VADC_G5_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0021908u)

/** Alias (User Manual Name) for VADC_G5_QSR0.
* To use register names with standard convension, please use VADC_G5_QSR0.
*/
#define	VADC_G5QSR0	(VADC_G5_QSR0)

/** \brief  1A80, Group Result Control Reg. */
#define VADC_G5_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021A80u)

/** Alias (User Manual Name) for VADC_G5_RCR0.
* To use register names with standard convension, please use VADC_G5_RCR0.
*/
#define	VADC_G5RCR0	(VADC_G5_RCR0)

/** \brief  1A84, Group Result Control Reg. */
#define VADC_G5_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021A84u)

/** Alias (User Manual Name) for VADC_G5_RCR1.
* To use register names with standard convension, please use VADC_G5_RCR1.
*/
#define	VADC_G5RCR1	(VADC_G5_RCR1)

/** \brief  1AA8, Group Result Control Reg. */
#define VADC_G5_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021AA8u)

/** Alias (User Manual Name) for VADC_G5_RCR10.
* To use register names with standard convension, please use VADC_G5_RCR10.
*/
#define	VADC_G5RCR10	(VADC_G5_RCR10)

/** \brief  1AAC, Group Result Control Reg. */
#define VADC_G5_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021AACu)

/** Alias (User Manual Name) for VADC_G5_RCR11.
* To use register names with standard convension, please use VADC_G5_RCR11.
*/
#define	VADC_G5RCR11	(VADC_G5_RCR11)

/** \brief  1AB0, Group Result Control Reg. */
#define VADC_G5_RCR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021AB0u)

/** Alias (User Manual Name) for VADC_G5_RCR12.
* To use register names with standard convension, please use VADC_G5_RCR12.
*/
#define	VADC_G5RCR12	(VADC_G5_RCR12)

/** \brief  1AB4, Group Result Control Reg. */
#define VADC_G5_RCR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021AB4u)

/** Alias (User Manual Name) for VADC_G5_RCR13.
* To use register names with standard convension, please use VADC_G5_RCR13.
*/
#define	VADC_G5RCR13	(VADC_G5_RCR13)

/** \brief  1AB8, Group Result Control Reg. */
#define VADC_G5_RCR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021AB8u)

/** Alias (User Manual Name) for VADC_G5_RCR14.
* To use register names with standard convension, please use VADC_G5_RCR14.
*/
#define	VADC_G5RCR14	(VADC_G5_RCR14)

/** \brief  1ABC, Group Result Control Reg. */
#define VADC_G5_RCR15 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021ABCu)

/** Alias (User Manual Name) for VADC_G5_RCR15.
* To use register names with standard convension, please use VADC_G5_RCR15.
*/
#define	VADC_G5RCR15	(VADC_G5_RCR15)

/** \brief  1A88, Group Result Control Reg. */
#define VADC_G5_RCR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021A88u)

/** Alias (User Manual Name) for VADC_G5_RCR2.
* To use register names with standard convension, please use VADC_G5_RCR2.
*/
#define	VADC_G5RCR2	(VADC_G5_RCR2)

/** \brief  1A8C, Group Result Control Reg. */
#define VADC_G5_RCR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021A8Cu)

/** Alias (User Manual Name) for VADC_G5_RCR3.
* To use register names with standard convension, please use VADC_G5_RCR3.
*/
#define	VADC_G5RCR3	(VADC_G5_RCR3)

/** \brief  1A90, Group Result Control Reg. */
#define VADC_G5_RCR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021A90u)

/** Alias (User Manual Name) for VADC_G5_RCR4.
* To use register names with standard convension, please use VADC_G5_RCR4.
*/
#define	VADC_G5RCR4	(VADC_G5_RCR4)

/** \brief  1A94, Group Result Control Reg. */
#define VADC_G5_RCR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021A94u)

/** Alias (User Manual Name) for VADC_G5_RCR5.
* To use register names with standard convension, please use VADC_G5_RCR5.
*/
#define	VADC_G5RCR5	(VADC_G5_RCR5)

/** \brief  1A98, Group Result Control Reg. */
#define VADC_G5_RCR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021A98u)

/** Alias (User Manual Name) for VADC_G5_RCR6.
* To use register names with standard convension, please use VADC_G5_RCR6.
*/
#define	VADC_G5RCR6	(VADC_G5_RCR6)

/** \brief  1A9C, Group Result Control Reg. */
#define VADC_G5_RCR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021A9Cu)

