luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G5_RCR7.
* To use register names with standard convension, please use VADC_G5_RCR7.
*/
#define	VADC_G5RCR7	(VADC_G5_RCR7)

/** \brief  1AA0, Group Result Control Reg. */
#define VADC_G5_RCR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021AA0u)

/** Alias (User Manual Name) for VADC_G5_RCR8.
* To use register names with standard convension, please use VADC_G5_RCR8.
*/
#define	VADC_G5RCR8	(VADC_G5_RCR8)

/** \brief  1AA4, Group Result Control Reg. */
#define VADC_G5_RCR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021AA4u)

/** Alias (User Manual Name) for VADC_G5_RCR9.
* To use register names with standard convension, please use VADC_G5_RCR9.
*/
#define	VADC_G5RCR9	(VADC_G5_RCR9)

/** \brief  1994, Result Event Flag Clear Register, Group */
#define VADC_G5_REFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFCLR*)0xF0021994u)

/** Alias (User Manual Name) for VADC_G5_REFCLR.
* To use register names with standard convension, please use VADC_G5_REFCLR.
*/
#define	VADC_G5REFCLR	(VADC_G5_REFCLR)

/** \brief  1984, Result Event Flag Register, Group */
#define VADC_G5_REFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFLAG*)0xF0021984u)

/** Alias (User Manual Name) for VADC_G5_REFLAG.
* To use register names with standard convension, please use VADC_G5_REFLAG.
*/
#define	VADC_G5REFLAG	(VADC_G5_REFLAG)

/** \brief  1B00, Group Result Register */
#define VADC_G5_RES0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B00u)

/** Alias (User Manual Name) for VADC_G5_RES0.
* To use register names with standard convension, please use VADC_G5_RES0.
*/
#define	VADC_G5RES0	(VADC_G5_RES0)

/** \brief  1B04, Group Result Register */
#define VADC_G5_RES1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B04u)

/** Alias (User Manual Name) for VADC_G5_RES1.
* To use register names with standard convension, please use VADC_G5_RES1.
*/
#define	VADC_G5RES1	(VADC_G5_RES1)

/** \brief  1B28, Group Result Register */
#define VADC_G5_RES10 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B28u)

/** Alias (User Manual Name) for VADC_G5_RES10.
* To use register names with standard convension, please use VADC_G5_RES10.
*/
#define	VADC_G5RES10	(VADC_G5_RES10)

/** \brief  1B2C, Group Result Register */
#define VADC_G5_RES11 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B2Cu)

/** Alias (User Manual Name) for VADC_G5_RES11.
* To use register names with standard convension, please use VADC_G5_RES11.
*/
#define	VADC_G5RES11	(VADC_G5_RES11)

/** \brief  1B30, Group Result Register */
#define VADC_G5_RES12 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B30u)

/** Alias (User Manual Name) for VADC_G5_RES12.
* To use register names with standard convension, please use VADC_G5_RES12.
*/
#define	VADC_G5RES12	(VADC_G5_RES12)

/** \brief  1B34, Group Result Register */
#define VADC_G5_RES13 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B34u)

/** Alias (User Manual Name) for VADC_G5_RES13.
* To use register names with standard convension, please use VADC_G5_RES13.
*/
#define	VADC_G5RES13	(VADC_G5_RES13)

/** \brief  1B38, Group Result Register */
#define VADC_G5_RES14 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B38u)

/** Alias (User Manual Name) for VADC_G5_RES14.
* To use register names with standard convension, please use VADC_G5_RES14.
*/
#define	VADC_G5RES14	(VADC_G5_RES14)

/** \brief  1B3C, Group Result Register */
#define VADC_G5_RES15 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B3Cu)

/** Alias (User Manual Name) for VADC_G5_RES15.
* To use register names with standard convension, please use VADC_G5_RES15.
*/
#define	VADC_G5RES15	(VADC_G5_RES15)

/** \brief  1B08, Group Result Register */
#define VADC_G5_RES2 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B08u)

/** Alias (User Manual Name) for VADC_G5_RES2.
* To use register names with standard convension, please use VADC_G5_RES2.
*/
#define	VADC_G5RES2	(VADC_G5_RES2)

/** \brief  1B0C, Group Result Register */
#define VADC_G5_RES3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B0Cu)

/** Alias (User Manual Name) for VADC_G5_RES3.
* To use register names with standard convension, please use VADC_G5_RES3.
*/
#define	VADC_G5RES3	(VADC_G5_RES3)

/** \brief  1B10, Group Result Register */
#define VADC_G5_RES4 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B10u)

/** Alias (User Manual Name) for VADC_G5_RES4.
* To use register names with standard convension, please use VADC_G5_RES4.
*/
#define	VADC_G5RES4	(VADC_G5_RES4)

/** \brief  1B14, Group Result Register */
#define VADC_G5_RES5 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B14u)

/** Alias (User Manual Name) for VADC_G5_RES5.
* To use register names with standard convension, please use VADC_G5_RES5.
*/
#define	VADC_G5RES5	(VADC_G5_RES5)

/** \brief  1B18, Group Result Register */
#define VADC_G5_RES6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B18u)

/** Alias (User Manual Name) for VADC_G5_RES6.
* To use register names with standard convension, please use VADC_G5_RES6.
*/
#define	VADC_G5RES6	(VADC_G5_RES6)

/** \brief  1B1C, Group Result Register */
#define VADC_G5_RES7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B1Cu)

/** Alias (User Manual Name) for VADC_G5_RES7.
* To use register names with standard convension, please use VADC_G5_RES7.
*/
#define	VADC_G5RES7	(VADC_G5_RES7)

/** \brief  1B20, Group Result Register */
#define VADC_G5_RES8 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B20u)

/** Alias (User Manual Name) for VADC_G5_RES8.
* To use register names with standard convension, please use VADC_G5_RES8.
*/
#define	VADC_G5RES8	(VADC_G5_RES8)

/** \brief  1B24, Group Result Register */
#define VADC_G5_RES9 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021B24u)

/** Alias (User Manual Name) for VADC_G5_RES9.
* To use register names with standard convension, please use VADC_G5_RES9.
*/
#define	VADC_G5RES9	(VADC_G5_RES9)

/** \brief  1B80, Group Result Reg., Debug */
#define VADC_G5_RESD0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021B80u)

