luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** \brief  19C0, Source Event Node Pointer Register, Group */
#define VADC_G5_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF00219C0u)

/** Alias (User Manual Name) for VADC_G5_SEVNP.
* To use register names with standard convension, please use VADC_G5_SEVNP.
*/
#define	VADC_G5SEVNP	(VADC_G5_SEVNP)

/** \brief  19C8, Service Request Software Activation Trigger, Group */
#define VADC_G5_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF00219C8u)

/** Alias (User Manual Name) for VADC_G5_SRACT.
* To use register names with standard convension, please use VADC_G5_SRACT.
*/
#define	VADC_G5SRACT	(VADC_G5_SRACT)

/** \brief  18C0, Synchronization Control Register, Group */
#define VADC_G5_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF00218C0u)

/** Alias (User Manual Name) for VADC_G5_SYNCTR.
* To use register names with standard convension, please use VADC_G5_SYNCTR.
*/
#define	VADC_G5SYNCTR	(VADC_G5_SYNCTR)

/** \brief  19F8, Valid Flag Register, Group */
#define VADC_G5_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF00219F8u)

/** Alias (User Manual Name) for VADC_G5_VFR.
* To use register names with standard convension, please use VADC_G5_VFR.
*/
#define	VADC_G5VFR	(VADC_G5_VFR)

/** \brief  1CB0, Alias Register, Group */
#define VADC_G6_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF0021CB0u)

/** Alias (User Manual Name) for VADC_G6_ALIAS.
* To use register names with standard convension, please use VADC_G6_ALIAS.
*/
#define	VADC_G6ALIAS	(VADC_G6_ALIAS)

/** \brief  1C80, Arbitration Configuration Register, Group */
#define VADC_G6_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0021C80u)

/** Alias (User Manual Name) for VADC_G6_ARBCFG.
* To use register names with standard convension, please use VADC_G6_ARBCFG.
*/
#define	VADC_G6ARBCFG	(VADC_G6_ARBCFG)

/** \brief  1C84, Arbitration Priority Register, Group */
#define VADC_G6_ARBPR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBPR*)0xF0021C84u)

/** Alias (User Manual Name) for VADC_G6_ARBPR.
* To use register names with standard convension, please use VADC_G6_ARBPR.
*/
#define	VADC_G6ARBPR	(VADC_G6_ARBPR)

/** \brief  1D20, Autoscan Source Control Register, Group */
#define VADC_G6_ASCTRL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASCTRL*)0xF0021D20u)

/** Alias (User Manual Name) for VADC_G6_ASCTRL.
* To use register names with standard convension, please use VADC_G6_ASCTRL.
*/
#define	VADC_G6ASCTRL	(VADC_G6_ASCTRL)

/** \brief  1D24, Autoscan Source Mode Register, Group */
#define VADC_G6_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0021D24u)

/** Alias (User Manual Name) for VADC_G6_ASMR.
* To use register names with standard convension, please use VADC_G6_ASMR.
*/
#define	VADC_G6ASMR	(VADC_G6_ASMR)

/** \brief  1D2C, Autoscan Source Pending Register, Group */
#define VADC_G6_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF0021D2Cu)

/** Alias (User Manual Name) for VADC_G6_ASPND.
* To use register names with standard convension, please use VADC_G6_ASPND.
*/
#define	VADC_G6ASPND	(VADC_G6_ASPND)

/** \brief  1D28, Autoscan Source Channel Select Register, Group */
#define VADC_G6_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0021D28u)

/** Alias (User Manual Name) for VADC_G6_ASSEL.
* To use register names with standard convension, please use VADC_G6_ASSEL.
*/
#define	VADC_G6ASSEL	(VADC_G6_ASSEL)

/** \brief  1CC8, Boundary Flag Register, Group */
#define VADC_G6_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF0021CC8u)

/** Alias (User Manual Name) for VADC_G6_BFL.
* To use register names with standard convension, please use VADC_G6_BFL.
*/
#define	VADC_G6BFL	(VADC_G6_BFL)

/** \brief  1CD0, Boundary Flag Control Register, Group */
#define VADC_G6_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF0021CD0u)

/** Alias (User Manual Name) for VADC_G6_BFLC.
* To use register names with standard convension, please use VADC_G6_BFLC.
*/
#define	VADC_G6BFLC	(VADC_G6_BFLC)

/** \brief  1CD4, Boundary Flag Node Pointer Register, Group */
#define VADC_G6_BFLNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLNP*)0xF0021CD4u)

/** Alias (User Manual Name) for VADC_G6_BFLNP.
* To use register names with standard convension, please use VADC_G6_BFLNP.
*/
#define	VADC_G6BFLNP	(VADC_G6_BFLNP)

/** \brief  1CCC, Boundary Flag Software Register, Group */
#define VADC_G6_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF0021CCCu)

/** Alias (User Manual Name) for VADC_G6_BFLS.
* To use register names with standard convension, please use VADC_G6_BFLS.
*/
#define	VADC_G6BFLS	(VADC_G6_BFLS)

/** \brief  1CB8, Boundary Select Register, Group */
#define VADC_G6_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF0021CB8u)

/** Alias (User Manual Name) for VADC_G6_BOUND.
* To use register names with standard convension, please use VADC_G6_BOUND.
*/
#define	VADC_G6BOUND	(VADC_G6_BOUND)

/** \brief  1D90, Channel Event Flag Clear Register, Group */
#define VADC_G6_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0021D90u)

/** Alias (User Manual Name) for VADC_G6_CEFCLR.
* To use register names with standard convension, please use VADC_G6_CEFCLR.
*/
#define	VADC_G6CEFCLR	(VADC_G6_CEFCLR)

/** \brief  1D80, Channel Event Flag Register, Group */
#define VADC_G6_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0021D80u)

/** Alias (User Manual Name) for VADC_G6_CEFLAG.
* To use register names with standard convension, please use VADC_G6_CEFLAG.
*/
#define	VADC_G6CEFLAG	(VADC_G6_CEFLAG)

/** \brief  1DA0, Channel Event Node Pointer Register 0, Group */
#define VADC_G6_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF0021DA0u)

/** Alias (User Manual Name) for VADC_G6_CEVNP0.
* To use register names with standard convension, please use VADC_G6_CEVNP0.
*/
#define	VADC_G6CEVNP0	(VADC_G6_CEVNP0)

/** \brief  1C88, Channel Assignment Register, Group */
#define VADC_G6_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0021C88u)

/** Alias (User Manual Name) for VADC_G6_CHASS.
* To use register names with standard convension, please use VADC_G6_CHASS.
*/
#define	VADC_G6CHASS	(VADC_G6_CHASS)

/** \brief  1E00, Group, Channel Ctrl. Reg. */
#define VADC_G6_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0021E00u)

