luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G6_RCR15.
* To use register names with standard convension, please use VADC_G6_RCR15.
*/
#define	VADC_G6RCR15	(VADC_G6_RCR15)

/** \brief  1E88, Group Result Control Reg. */
#define VADC_G6_RCR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021E88u)

/** Alias (User Manual Name) for VADC_G6_RCR2.
* To use register names with standard convension, please use VADC_G6_RCR2.
*/
#define	VADC_G6RCR2	(VADC_G6_RCR2)

/** \brief  1E8C, Group Result Control Reg. */
#define VADC_G6_RCR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021E8Cu)

/** Alias (User Manual Name) for VADC_G6_RCR3.
* To use register names with standard convension, please use VADC_G6_RCR3.
*/
#define	VADC_G6RCR3	(VADC_G6_RCR3)

/** \brief  1E90, Group Result Control Reg. */
#define VADC_G6_RCR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021E90u)

/** Alias (User Manual Name) for VADC_G6_RCR4.
* To use register names with standard convension, please use VADC_G6_RCR4.
*/
#define	VADC_G6RCR4	(VADC_G6_RCR4)

/** \brief  1E94, Group Result Control Reg. */
#define VADC_G6_RCR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021E94u)

/** Alias (User Manual Name) for VADC_G6_RCR5.
* To use register names with standard convension, please use VADC_G6_RCR5.
*/
#define	VADC_G6RCR5	(VADC_G6_RCR5)

/** \brief  1E98, Group Result Control Reg. */
#define VADC_G6_RCR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021E98u)

/** Alias (User Manual Name) for VADC_G6_RCR6.
* To use register names with standard convension, please use VADC_G6_RCR6.
*/
#define	VADC_G6RCR6	(VADC_G6_RCR6)

/** \brief  1E9C, Group Result Control Reg. */
#define VADC_G6_RCR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021E9Cu)

/** Alias (User Manual Name) for VADC_G6_RCR7.
* To use register names with standard convension, please use VADC_G6_RCR7.
*/
#define	VADC_G6RCR7	(VADC_G6_RCR7)

/** \brief  1EA0, Group Result Control Reg. */
#define VADC_G6_RCR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021EA0u)

/** Alias (User Manual Name) for VADC_G6_RCR8.
* To use register names with standard convension, please use VADC_G6_RCR8.
*/
#define	VADC_G6RCR8	(VADC_G6_RCR8)

/** \brief  1EA4, Group Result Control Reg. */
#define VADC_G6_RCR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0021EA4u)

/** Alias (User Manual Name) for VADC_G6_RCR9.
* To use register names with standard convension, please use VADC_G6_RCR9.
*/
#define	VADC_G6RCR9	(VADC_G6_RCR9)

/** \brief  1D94, Result Event Flag Clear Register, Group */
#define VADC_G6_REFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFCLR*)0xF0021D94u)

/** Alias (User Manual Name) for VADC_G6_REFCLR.
* To use register names with standard convension, please use VADC_G6_REFCLR.
*/
#define	VADC_G6REFCLR	(VADC_G6_REFCLR)

/** \brief  1D84, Result Event Flag Register, Group */
#define VADC_G6_REFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REFLAG*)0xF0021D84u)

/** Alias (User Manual Name) for VADC_G6_REFLAG.
* To use register names with standard convension, please use VADC_G6_REFLAG.
*/
#define	VADC_G6REFLAG	(VADC_G6_REFLAG)

/** \brief  1F00, Group Result Register */
#define VADC_G6_RES0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F00u)

/** Alias (User Manual Name) for VADC_G6_RES0.
* To use register names with standard convension, please use VADC_G6_RES0.
*/
#define	VADC_G6RES0	(VADC_G6_RES0)

/** \brief  1F04, Group Result Register */
#define VADC_G6_RES1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F04u)

/** Alias (User Manual Name) for VADC_G6_RES1.
* To use register names with standard convension, please use VADC_G6_RES1.
*/
#define	VADC_G6RES1	(VADC_G6_RES1)

/** \brief  1F28, Group Result Register */
#define VADC_G6_RES10 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F28u)

/** Alias (User Manual Name) for VADC_G6_RES10.
* To use register names with standard convension, please use VADC_G6_RES10.
*/
#define	VADC_G6RES10	(VADC_G6_RES10)

/** \brief  1F2C, Group Result Register */
#define VADC_G6_RES11 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F2Cu)

/** Alias (User Manual Name) for VADC_G6_RES11.
* To use register names with standard convension, please use VADC_G6_RES11.
*/
#define	VADC_G6RES11	(VADC_G6_RES11)

/** \brief  1F30, Group Result Register */
#define VADC_G6_RES12 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F30u)

/** Alias (User Manual Name) for VADC_G6_RES12.
* To use register names with standard convension, please use VADC_G6_RES12.
*/
#define	VADC_G6RES12	(VADC_G6_RES12)

/** \brief  1F34, Group Result Register */
#define VADC_G6_RES13 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F34u)

/** Alias (User Manual Name) for VADC_G6_RES13.
* To use register names with standard convension, please use VADC_G6_RES13.
*/
#define	VADC_G6RES13	(VADC_G6_RES13)

/** \brief  1F38, Group Result Register */
#define VADC_G6_RES14 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F38u)

/** Alias (User Manual Name) for VADC_G6_RES14.
* To use register names with standard convension, please use VADC_G6_RES14.
*/
#define	VADC_G6RES14	(VADC_G6_RES14)

/** \brief  1F3C, Group Result Register */
#define VADC_G6_RES15 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F3Cu)

/** Alias (User Manual Name) for VADC_G6_RES15.
* To use register names with standard convension, please use VADC_G6_RES15.
*/
#define	VADC_G6RES15	(VADC_G6_RES15)

/** \brief  1F08, Group Result Register */
#define VADC_G6_RES2 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F08u)

/** Alias (User Manual Name) for VADC_G6_RES2.
* To use register names with standard convension, please use VADC_G6_RES2.
*/
#define	VADC_G6RES2	(VADC_G6_RES2)

/** \brief  1F0C, Group Result Register */
#define VADC_G6_RES3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F0Cu)

/** Alias (User Manual Name) for VADC_G6_RES3.
* To use register names with standard convension, please use VADC_G6_RES3.
*/
#define	VADC_G6RES3	(VADC_G6_RES3)

/** \brief  1F10, Group Result Register */
#define VADC_G6_RES4 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F10u)

/** Alias (User Manual Name) for VADC_G6_RES4.
* To use register names with standard convension, please use VADC_G6_RES4.
*/
#define	VADC_G6RES4	(VADC_G6_RES4)

/** \brief  1F14, Group Result Register */
#define VADC_G6_RES5 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F14u)

