luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G6_RES5.
* To use register names with standard convension, please use VADC_G6_RES5.
*/
#define	VADC_G6RES5	(VADC_G6_RES5)

/** \brief  1F18, Group Result Register */
#define VADC_G6_RES6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F18u)

/** Alias (User Manual Name) for VADC_G6_RES6.
* To use register names with standard convension, please use VADC_G6_RES6.
*/
#define	VADC_G6RES6	(VADC_G6_RES6)

/** \brief  1F1C, Group Result Register */
#define VADC_G6_RES7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F1Cu)

/** Alias (User Manual Name) for VADC_G6_RES7.
* To use register names with standard convension, please use VADC_G6_RES7.
*/
#define	VADC_G6RES7	(VADC_G6_RES7)

/** \brief  1F20, Group Result Register */
#define VADC_G6_RES8 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F20u)

/** Alias (User Manual Name) for VADC_G6_RES8.
* To use register names with standard convension, please use VADC_G6_RES8.
*/
#define	VADC_G6RES8	(VADC_G6_RES8)

/** \brief  1F24, Group Result Register */
#define VADC_G6_RES9 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0021F24u)

/** Alias (User Manual Name) for VADC_G6_RES9.
* To use register names with standard convension, please use VADC_G6_RES9.
*/
#define	VADC_G6RES9	(VADC_G6_RES9)

/** \brief  1F80, Group Result Reg., Debug */
#define VADC_G6_RESD0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021F80u)

/** Alias (User Manual Name) for VADC_G6_RESD0.
* To use register names with standard convension, please use VADC_G6_RESD0.
*/
#define	VADC_G6RESD0	(VADC_G6_RESD0)

/** \brief  1F84, Group Result Reg., Debug */
#define VADC_G6_RESD1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021F84u)

/** Alias (User Manual Name) for VADC_G6_RESD1.
* To use register names with standard convension, please use VADC_G6_RESD1.
*/
#define	VADC_G6RESD1	(VADC_G6_RESD1)

/** \brief  1FA8, Group Result Reg., Debug */
#define VADC_G6_RESD10 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021FA8u)

/** Alias (User Manual Name) for VADC_G6_RESD10.
* To use register names with standard convension, please use VADC_G6_RESD10.
*/
#define	VADC_G6RESD10	(VADC_G6_RESD10)

/** \brief  1FAC, Group Result Reg., Debug */
#define VADC_G6_RESD11 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021FACu)

/** Alias (User Manual Name) for VADC_G6_RESD11.
* To use register names with standard convension, please use VADC_G6_RESD11.
*/
#define	VADC_G6RESD11	(VADC_G6_RESD11)

/** \brief  1FB0, Group Result Reg., Debug */
#define VADC_G6_RESD12 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021FB0u)

/** Alias (User Manual Name) for VADC_G6_RESD12.
* To use register names with standard convension, please use VADC_G6_RESD12.
*/
#define	VADC_G6RESD12	(VADC_G6_RESD12)

/** \brief  1FB4, Group Result Reg., Debug */
#define VADC_G6_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021FB4u)

/** Alias (User Manual Name) for VADC_G6_RESD13.
* To use register names with standard convension, please use VADC_G6_RESD13.
*/
#define	VADC_G6RESD13	(VADC_G6_RESD13)

/** \brief  1FB8, Group Result Reg., Debug */
#define VADC_G6_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021FB8u)

/** Alias (User Manual Name) for VADC_G6_RESD14.
* To use register names with standard convension, please use VADC_G6_RESD14.
*/
#define	VADC_G6RESD14	(VADC_G6_RESD14)

/** \brief  1FBC, Group Result Reg., Debug */
#define VADC_G6_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021FBCu)

/** Alias (User Manual Name) for VADC_G6_RESD15.
* To use register names with standard convension, please use VADC_G6_RESD15.
*/
#define	VADC_G6RESD15	(VADC_G6_RESD15)

/** \brief  1F88, Group Result Reg., Debug */
#define VADC_G6_RESD2 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021F88u)

/** Alias (User Manual Name) for VADC_G6_RESD2.
* To use register names with standard convension, please use VADC_G6_RESD2.
*/
#define	VADC_G6RESD2	(VADC_G6_RESD2)

/** \brief  1F8C, Group Result Reg., Debug */
#define VADC_G6_RESD3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021F8Cu)

/** Alias (User Manual Name) for VADC_G6_RESD3.
* To use register names with standard convension, please use VADC_G6_RESD3.
*/
#define	VADC_G6RESD3	(VADC_G6_RESD3)

/** \brief  1F90, Group Result Reg., Debug */
#define VADC_G6_RESD4 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021F90u)

/** Alias (User Manual Name) for VADC_G6_RESD4.
* To use register names with standard convension, please use VADC_G6_RESD4.
*/
#define	VADC_G6RESD4	(VADC_G6_RESD4)

/** \brief  1F94, Group Result Reg., Debug */
#define VADC_G6_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021F94u)

/** Alias (User Manual Name) for VADC_G6_RESD5.
* To use register names with standard convension, please use VADC_G6_RESD5.
*/
#define	VADC_G6RESD5	(VADC_G6_RESD5)

/** \brief  1F98, Group Result Reg., Debug */
#define VADC_G6_RESD6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021F98u)

/** Alias (User Manual Name) for VADC_G6_RESD6.
* To use register names with standard convension, please use VADC_G6_RESD6.
*/
#define	VADC_G6RESD6	(VADC_G6_RESD6)

/** \brief  1F9C, Group Result Reg., Debug */
#define VADC_G6_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021F9Cu)

/** Alias (User Manual Name) for VADC_G6_RESD7.
* To use register names with standard convension, please use VADC_G6_RESD7.
*/
#define	VADC_G6RESD7	(VADC_G6_RESD7)

/** \brief  1FA0, Group Result Reg., Debug */
#define VADC_G6_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021FA0u)

/** Alias (User Manual Name) for VADC_G6_RESD8.
* To use register names with standard convension, please use VADC_G6_RESD8.
*/
#define	VADC_G6RESD8	(VADC_G6_RESD8)

/** \brief  1FA4, Group Result Reg., Debug */
#define VADC_G6_RESD9 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0021FA4u)

/** Alias (User Manual Name) for VADC_G6_RESD9.
* To use register names with standard convension, please use VADC_G6_RESD9.
*/
#define	VADC_G6RESD9	(VADC_G6_RESD9)

/** \brief  1DB0, Result Event Node Pointer Register 0, Group */
#define VADC_G6_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF0021DB0u)

/** Alias (User Manual Name) for VADC_G6_REVNP0.
* To use register names with standard convension, please use VADC_G6_REVNP0.
*/
#define	VADC_G6REVNP0	(VADC_G6_REVNP0)

/** \brief  1DB4, Result Event Node Pointer Register 1, Group */
#define VADC_G6_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF0021DB4u)

/** Alias (User Manual Name) for VADC_G6_REVNP1.
* To use register names with standard convension, please use VADC_G6_REVNP1.
*/
#define	VADC_G6REVNP1	(VADC_G6_REVNP1)

/** \brief  1C8C, Result Assignment Register, Group */
#define VADC_G6_RRASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RRASS*)0xF0021C8Cu)

