luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G6_RRASS.
* To use register names with standard convension, please use VADC_G6_RRASS.
*/
#define	VADC_G6RRASS	(VADC_G6_RRASS)

/** \brief  1D98, Source Event Flag Clear Register, Group */
#define VADC_G6_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0021D98u)

/** Alias (User Manual Name) for VADC_G6_SEFCLR.
* To use register names with standard convension, please use VADC_G6_SEFCLR.
*/
#define	VADC_G6SEFCLR	(VADC_G6_SEFCLR)

/** \brief  1D88, Source Event Flag Register, Group */
#define VADC_G6_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0021D88u)

/** Alias (User Manual Name) for VADC_G6_SEFLAG.
* To use register names with standard convension, please use VADC_G6_SEFLAG.
*/
#define	VADC_G6SEFLAG	(VADC_G6_SEFLAG)

/** \brief  1DC0, Source Event Node Pointer Register, Group */
#define VADC_G6_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF0021DC0u)

/** Alias (User Manual Name) for VADC_G6_SEVNP.
* To use register names with standard convension, please use VADC_G6_SEVNP.
*/
#define	VADC_G6SEVNP	(VADC_G6_SEVNP)

/** \brief  1DC8, Service Request Software Activation Trigger, Group */
#define VADC_G6_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF0021DC8u)

/** Alias (User Manual Name) for VADC_G6_SRACT.
* To use register names with standard convension, please use VADC_G6_SRACT.
*/
#define	VADC_G6SRACT	(VADC_G6_SRACT)

/** \brief  1CC0, Synchronization Control Register, Group */
#define VADC_G6_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF0021CC0u)

/** Alias (User Manual Name) for VADC_G6_SYNCTR.
* To use register names with standard convension, please use VADC_G6_SYNCTR.
*/
#define	VADC_G6SYNCTR	(VADC_G6_SYNCTR)

/** \brief  1DF8, Valid Flag Register, Group */
#define VADC_G6_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF0021DF8u)

/** Alias (User Manual Name) for VADC_G6_VFR.
* To use register names with standard convension, please use VADC_G6_VFR.
*/
#define	VADC_G6VFR	(VADC_G6_VFR)

/** \brief  20B0, Alias Register, Group */
#define VADC_G7_ALIAS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ALIAS*)0xF00220B0u)

/** Alias (User Manual Name) for VADC_G7_ALIAS.
* To use register names with standard convension, please use VADC_G7_ALIAS.
*/
#define	VADC_G7ALIAS	(VADC_G7_ALIAS)

/** \brief  2080, Arbitration Configuration Register, Group */
#define VADC_G7_ARBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBCFG*)0xF0022080u)

/** Alias (User Manual Name) for VADC_G7_ARBCFG.
* To use register names with standard convension, please use VADC_G7_ARBCFG.
*/
#define	VADC_G7ARBCFG	(VADC_G7_ARBCFG)

/** \brief  2084, Arbitration Priority Register, Group */
#define VADC_G7_ARBPR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ARBPR*)0xF0022084u)

/** Alias (User Manual Name) for VADC_G7_ARBPR.
* To use register names with standard convension, please use VADC_G7_ARBPR.
*/
#define	VADC_G7ARBPR	(VADC_G7_ARBPR)

/** \brief  2120, Autoscan Source Control Register, Group */
#define VADC_G7_ASCTRL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASCTRL*)0xF0022120u)

/** Alias (User Manual Name) for VADC_G7_ASCTRL.
* To use register names with standard convension, please use VADC_G7_ASCTRL.
*/
#define	VADC_G7ASCTRL	(VADC_G7_ASCTRL)

/** \brief  2124, Autoscan Source Mode Register, Group */
#define VADC_G7_ASMR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASMR*)0xF0022124u)

/** Alias (User Manual Name) for VADC_G7_ASMR.
* To use register names with standard convension, please use VADC_G7_ASMR.
*/
#define	VADC_G7ASMR	(VADC_G7_ASMR)

/** \brief  212C, Autoscan Source Pending Register, Group */
#define VADC_G7_ASPND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASPND*)0xF002212Cu)

/** Alias (User Manual Name) for VADC_G7_ASPND.
* To use register names with standard convension, please use VADC_G7_ASPND.
*/
#define	VADC_G7ASPND	(VADC_G7_ASPND)

/** \brief  2128, Autoscan Source Channel Select Register, Group */
#define VADC_G7_ASSEL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_ASSEL*)0xF0022128u)

/** Alias (User Manual Name) for VADC_G7_ASSEL.
* To use register names with standard convension, please use VADC_G7_ASSEL.
*/
#define	VADC_G7ASSEL	(VADC_G7_ASSEL)

/** \brief  20C8, Boundary Flag Register, Group */
#define VADC_G7_BFL /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFL*)0xF00220C8u)

/** Alias (User Manual Name) for VADC_G7_BFL.
* To use register names with standard convension, please use VADC_G7_BFL.
*/
#define	VADC_G7BFL	(VADC_G7_BFL)

/** \brief  20D0, Boundary Flag Control Register, Group */
#define VADC_G7_BFLC /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLC*)0xF00220D0u)

/** Alias (User Manual Name) for VADC_G7_BFLC.
* To use register names with standard convension, please use VADC_G7_BFLC.
*/
#define	VADC_G7BFLC	(VADC_G7_BFLC)

/** \brief  20D4, Boundary Flag Node Pointer Register, Group */
#define VADC_G7_BFLNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLNP*)0xF00220D4u)

/** Alias (User Manual Name) for VADC_G7_BFLNP.
* To use register names with standard convension, please use VADC_G7_BFLNP.
*/
#define	VADC_G7BFLNP	(VADC_G7_BFLNP)

/** \brief  20CC, Boundary Flag Software Register, Group */
#define VADC_G7_BFLS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BFLS*)0xF00220CCu)

/** Alias (User Manual Name) for VADC_G7_BFLS.
* To use register names with standard convension, please use VADC_G7_BFLS.
*/
#define	VADC_G7BFLS	(VADC_G7_BFLS)

/** \brief  20B8, Boundary Select Register, Group */
#define VADC_G7_BOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_G_BOUND*)0xF00220B8u)

/** Alias (User Manual Name) for VADC_G7_BOUND.
* To use register names with standard convension, please use VADC_G7_BOUND.
*/
#define	VADC_G7BOUND	(VADC_G7_BOUND)

/** \brief  2190, Channel Event Flag Clear Register, Group */
#define VADC_G7_CEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFCLR*)0xF0022190u)

/** Alias (User Manual Name) for VADC_G7_CEFCLR.
* To use register names with standard convension, please use VADC_G7_CEFCLR.
*/
#define	VADC_G7CEFCLR	(VADC_G7_CEFCLR)

/** \brief  2180, Channel Event Flag Register, Group */
#define VADC_G7_CEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEFLAG*)0xF0022180u)

/** Alias (User Manual Name) for VADC_G7_CEFLAG.
* To use register names with standard convension, please use VADC_G7_CEFLAG.
*/
#define	VADC_G7CEFLAG	(VADC_G7_CEFLAG)

/** \brief  21A0, Channel Event Node Pointer Register 0, Group */
#define VADC_G7_CEVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CEVNP0*)0xF00221A0u)

/** Alias (User Manual Name) for VADC_G7_CEVNP0.
* To use register names with standard convension, please use VADC_G7_CEVNP0.
*/
#define	VADC_G7CEVNP0	(VADC_G7_CEVNP0)

/** \brief  2088, Channel Assignment Register, Group */
#define VADC_G7_CHASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHASS*)0xF0022088u)

/** Alias (User Manual Name) for VADC_G7_CHASS.
* To use register names with standard convension, please use VADC_G7_CHASS.
*/
#define	VADC_G7CHASS	(VADC_G7_CHASS)

