luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** \brief  2200, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0022200u)

/** Alias (User Manual Name) for VADC_G7_CHCTR0.
* To use register names with standard convension, please use VADC_G7_CHCTR0.
*/
#define	VADC_G7CHCTR0	(VADC_G7_CHCTR0)

/** \brief  2204, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0022204u)

/** Alias (User Manual Name) for VADC_G7_CHCTR1.
* To use register names with standard convension, please use VADC_G7_CHCTR1.
*/
#define	VADC_G7CHCTR1	(VADC_G7_CHCTR1)

/** \brief  2208, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR2 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0022208u)

/** Alias (User Manual Name) for VADC_G7_CHCTR2.
* To use register names with standard convension, please use VADC_G7_CHCTR2.
*/
#define	VADC_G7CHCTR2	(VADC_G7_CHCTR2)

/** \brief  220C, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF002220Cu)

/** Alias (User Manual Name) for VADC_G7_CHCTR3.
* To use register names with standard convension, please use VADC_G7_CHCTR3.
*/
#define	VADC_G7CHCTR3	(VADC_G7_CHCTR3)

/** \brief  2210, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR4 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0022210u)

/** Alias (User Manual Name) for VADC_G7_CHCTR4.
* To use register names with standard convension, please use VADC_G7_CHCTR4.
*/
#define	VADC_G7CHCTR4	(VADC_G7_CHCTR4)

/** \brief  2214, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR5 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0022214u)

/** Alias (User Manual Name) for VADC_G7_CHCTR5.
* To use register names with standard convension, please use VADC_G7_CHCTR5.
*/
#define	VADC_G7CHCTR5	(VADC_G7_CHCTR5)

/** \brief  2218, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0022218u)

/** Alias (User Manual Name) for VADC_G7_CHCTR6.
* To use register names with standard convension, please use VADC_G7_CHCTR6.
*/
#define	VADC_G7CHCTR6	(VADC_G7_CHCTR6)

/** \brief  221C, Group, Channel Ctrl. Reg. */
#define VADC_G7_CHCTR7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF002221Cu)

/** Alias (User Manual Name) for VADC_G7_CHCTR7.
* To use register names with standard convension, please use VADC_G7_CHCTR7.
*/
#define	VADC_G7CHCTR7	(VADC_G7_CHCTR7)

/** \brief  21F0, External Multiplexer Control Register, Group x */
#define VADC_G7_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00221F0u)

/** Alias (User Manual Name) for VADC_G7_EMUXCTR.
* To use register names with standard convension, please use VADC_G7_EMUXCTR.
*/
#define	VADC_G7EMUXCTR	(VADC_G7_EMUXCTR)

/** \brief  20A0, Input Class Register */
#define VADC_G7_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00220A0u)

/** Alias (User Manual Name) for VADC_G7_ICLASS0.
* To use register names with standard convension, please use VADC_G7_ICLASS0.
*/
#define	VADC_G7ICLASS0	(VADC_G7_ICLASS0)

/** \brief  20A4, Input Class Register */
#define VADC_G7_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00220A4u)

/** Alias (User Manual Name) for VADC_G7_ICLASS1.
* To use register names with standard convension, please use VADC_G7_ICLASS1.
*/
#define	VADC_G7ICLASS1	(VADC_G7_ICLASS1)

/** \brief  210C, Queue 0 Register 0, Group */
#define VADC_G7_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF002210Cu)

/** Alias (User Manual Name) for VADC_G7_Q0R0.
* To use register names with standard convension, please use VADC_G7_Q0R0.
*/
#define	VADC_G7Q0R0	(VADC_G7_Q0R0)

/** \brief  2110, Queue 0 Input Register, Group */
#define VADC_G7_QBUR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR0*)0xF0022110u)

/** Alias (User Manual Name) for VADC_G7_QBUR0.
* To use register names with standard convension, please use VADC_G7_QBUR0.
*/
#define	VADC_G7QBUR0	(VADC_G7_QBUR0)

/** \brief  2100, Queue 0 Source Control Register, Group */
#define VADC_G7_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0022100u)

/** Alias (User Manual Name) for VADC_G7_QCTRL0.
* To use register names with standard convension, please use VADC_G7_QCTRL0.
*/
#define	VADC_G7QCTRL0	(VADC_G7_QCTRL0)

/** \brief  2110, Queue 0 Input Register, Group */
#define VADC_G7_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QINR0*)0xF0022110u)

/** Alias (User Manual Name) for VADC_G7_QINR0.
* To use register names with standard convension, please use VADC_G7_QINR0.
*/
#define	VADC_G7QINR0	(VADC_G7_QINR0)

/** \brief  2104, Queue 0 Mode Register, Group */
#define VADC_G7_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0022104u)

/** Alias (User Manual Name) for VADC_G7_QMR0.
* To use register names with standard convension, please use VADC_G7_QMR0.
*/
#define	VADC_G7QMR0	(VADC_G7_QMR0)

/** \brief  2108, Queue 0 Status Register, Group */
#define VADC_G7_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0022108u)

/** Alias (User Manual Name) for VADC_G7_QSR0.
* To use register names with standard convension, please use VADC_G7_QSR0.
*/
#define	VADC_G7QSR0	(VADC_G7_QSR0)

/** \brief  2280, Group Result Control Reg. */
#define VADC_G7_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0022280u)

/** Alias (User Manual Name) for VADC_G7_RCR0.
* To use register names with standard convension, please use VADC_G7_RCR0.
*/
#define	VADC_G7RCR0	(VADC_G7_RCR0)

/** \brief  2284, Group Result Control Reg. */
#define VADC_G7_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0022284u)

/** Alias (User Manual Name) for VADC_G7_RCR1.
* To use register names with standard convension, please use VADC_G7_RCR1.
*/
#define	VADC_G7RCR1	(VADC_G7_RCR1)

/** \brief  22A8, Group Result Control Reg. */
#define VADC_G7_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF00222A8u)

/** Alias (User Manual Name) for VADC_G7_RCR10.
* To use register names with standard convension, please use VADC_G7_RCR10.
*/
#define	VADC_G7RCR10	(VADC_G7_RCR10)

