luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G7_RES5.
* To use register names with standard convension, please use VADC_G7_RES5.
*/
#define	VADC_G7RES5	(VADC_G7_RES5)

/** \brief  2318, Group Result Register */
#define VADC_G7_RES6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0022318u)

/** Alias (User Manual Name) for VADC_G7_RES6.
* To use register names with standard convension, please use VADC_G7_RES6.
*/
#define	VADC_G7RES6	(VADC_G7_RES6)

/** \brief  231C, Group Result Register */
#define VADC_G7_RES7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF002231Cu)

/** Alias (User Manual Name) for VADC_G7_RES7.
* To use register names with standard convension, please use VADC_G7_RES7.
*/
#define	VADC_G7RES7	(VADC_G7_RES7)

/** \brief  2320, Group Result Register */
#define VADC_G7_RES8 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0022320u)

/** Alias (User Manual Name) for VADC_G7_RES8.
* To use register names with standard convension, please use VADC_G7_RES8.
*/
#define	VADC_G7RES8	(VADC_G7_RES8)

/** \brief  2324, Group Result Register */
#define VADC_G7_RES9 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RES*)0xF0022324u)

/** Alias (User Manual Name) for VADC_G7_RES9.
* To use register names with standard convension, please use VADC_G7_RES9.
*/
#define	VADC_G7RES9	(VADC_G7_RES9)

/** \brief  2380, Group Result Reg., Debug */
#define VADC_G7_RESD0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0022380u)

/** Alias (User Manual Name) for VADC_G7_RESD0.
* To use register names with standard convension, please use VADC_G7_RESD0.
*/
#define	VADC_G7RESD0	(VADC_G7_RESD0)

/** \brief  2384, Group Result Reg., Debug */
#define VADC_G7_RESD1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0022384u)

/** Alias (User Manual Name) for VADC_G7_RESD1.
* To use register names with standard convension, please use VADC_G7_RESD1.
*/
#define	VADC_G7RESD1	(VADC_G7_RESD1)

/** \brief  23A8, Group Result Reg., Debug */
#define VADC_G7_RESD10 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00223A8u)

/** Alias (User Manual Name) for VADC_G7_RESD10.
* To use register names with standard convension, please use VADC_G7_RESD10.
*/
#define	VADC_G7RESD10	(VADC_G7_RESD10)

/** \brief  23AC, Group Result Reg., Debug */
#define VADC_G7_RESD11 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00223ACu)

/** Alias (User Manual Name) for VADC_G7_RESD11.
* To use register names with standard convension, please use VADC_G7_RESD11.
*/
#define	VADC_G7RESD11	(VADC_G7_RESD11)

/** \brief  23B0, Group Result Reg., Debug */
#define VADC_G7_RESD12 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00223B0u)

/** Alias (User Manual Name) for VADC_G7_RESD12.
* To use register names with standard convension, please use VADC_G7_RESD12.
*/
#define	VADC_G7RESD12	(VADC_G7_RESD12)

/** \brief  23B4, Group Result Reg., Debug */
#define VADC_G7_RESD13 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00223B4u)

/** Alias (User Manual Name) for VADC_G7_RESD13.
* To use register names with standard convension, please use VADC_G7_RESD13.
*/
#define	VADC_G7RESD13	(VADC_G7_RESD13)

/** \brief  23B8, Group Result Reg., Debug */
#define VADC_G7_RESD14 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00223B8u)

/** Alias (User Manual Name) for VADC_G7_RESD14.
* To use register names with standard convension, please use VADC_G7_RESD14.
*/
#define	VADC_G7RESD14	(VADC_G7_RESD14)

/** \brief  23BC, Group Result Reg., Debug */
#define VADC_G7_RESD15 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00223BCu)

/** Alias (User Manual Name) for VADC_G7_RESD15.
* To use register names with standard convension, please use VADC_G7_RESD15.
*/
#define	VADC_G7RESD15	(VADC_G7_RESD15)

/** \brief  2388, Group Result Reg., Debug */
#define VADC_G7_RESD2 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0022388u)

/** Alias (User Manual Name) for VADC_G7_RESD2.
* To use register names with standard convension, please use VADC_G7_RESD2.
*/
#define	VADC_G7RESD2	(VADC_G7_RESD2)

/** \brief  238C, Group Result Reg., Debug */
#define VADC_G7_RESD3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF002238Cu)

/** Alias (User Manual Name) for VADC_G7_RESD3.
* To use register names with standard convension, please use VADC_G7_RESD3.
*/
#define	VADC_G7RESD3	(VADC_G7_RESD3)

/** \brief  2390, Group Result Reg., Debug */
#define VADC_G7_RESD4 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0022390u)

/** Alias (User Manual Name) for VADC_G7_RESD4.
* To use register names with standard convension, please use VADC_G7_RESD4.
*/
#define	VADC_G7RESD4	(VADC_G7_RESD4)

/** \brief  2394, Group Result Reg., Debug */
#define VADC_G7_RESD5 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0022394u)

/** Alias (User Manual Name) for VADC_G7_RESD5.
* To use register names with standard convension, please use VADC_G7_RESD5.
*/
#define	VADC_G7RESD5	(VADC_G7_RESD5)

/** \brief  2398, Group Result Reg., Debug */
#define VADC_G7_RESD6 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF0022398u)

/** Alias (User Manual Name) for VADC_G7_RESD6.
* To use register names with standard convension, please use VADC_G7_RESD6.
*/
#define	VADC_G7RESD6	(VADC_G7_RESD6)

/** \brief  239C, Group Result Reg., Debug */
#define VADC_G7_RESD7 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF002239Cu)

/** Alias (User Manual Name) for VADC_G7_RESD7.
* To use register names with standard convension, please use VADC_G7_RESD7.
*/
#define	VADC_G7RESD7	(VADC_G7_RESD7)

/** \brief  23A0, Group Result Reg., Debug */
#define VADC_G7_RESD8 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00223A0u)

/** Alias (User Manual Name) for VADC_G7_RESD8.
* To use register names with standard convension, please use VADC_G7_RESD8.
*/
#define	VADC_G7RESD8	(VADC_G7_RESD8)

/** \brief  23A4, Group Result Reg., Debug */
#define VADC_G7_RESD9 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RESD*)0xF00223A4u)

/** Alias (User Manual Name) for VADC_G7_RESD9.
* To use register names with standard convension, please use VADC_G7_RESD9.
*/
#define	VADC_G7RESD9	(VADC_G7_RESD9)

/** \brief  21B0, Result Event Node Pointer Register 0, Group */
#define VADC_G7_REVNP0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP0*)0xF00221B0u)

