luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxVadc_reg.h
/** Alias (User Manual Name) for VADC_G7_REVNP0.
* To use register names with standard convension, please use VADC_G7_REVNP0.
*/
#define	VADC_G7REVNP0	(VADC_G7_REVNP0)

/** \brief  21B4, Result Event Node Pointer Register 1, Group */
#define VADC_G7_REVNP1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_REVNP1*)0xF00221B4u)

/** Alias (User Manual Name) for VADC_G7_REVNP1.
* To use register names with standard convension, please use VADC_G7_REVNP1.
*/
#define	VADC_G7REVNP1	(VADC_G7_REVNP1)

/** \brief  208C, Result Assignment Register, Group */
#define VADC_G7_RRASS /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RRASS*)0xF002208Cu)

/** Alias (User Manual Name) for VADC_G7_RRASS.
* To use register names with standard convension, please use VADC_G7_RRASS.
*/
#define	VADC_G7RRASS	(VADC_G7_RRASS)

/** \brief  2198, Source Event Flag Clear Register, Group */
#define VADC_G7_SEFCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFCLR*)0xF0022198u)

/** Alias (User Manual Name) for VADC_G7_SEFCLR.
* To use register names with standard convension, please use VADC_G7_SEFCLR.
*/
#define	VADC_G7SEFCLR	(VADC_G7_SEFCLR)

/** \brief  2188, Source Event Flag Register, Group */
#define VADC_G7_SEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEFLAG*)0xF0022188u)

/** Alias (User Manual Name) for VADC_G7_SEFLAG.
* To use register names with standard convension, please use VADC_G7_SEFLAG.
*/
#define	VADC_G7SEFLAG	(VADC_G7_SEFLAG)

/** \brief  21C0, Source Event Node Pointer Register, Group */
#define VADC_G7_SEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SEVNP*)0xF00221C0u)

/** Alias (User Manual Name) for VADC_G7_SEVNP.
* To use register names with standard convension, please use VADC_G7_SEVNP.
*/
#define	VADC_G7SEVNP	(VADC_G7_SEVNP)

/** \brief  21C8, Service Request Software Activation Trigger, Group */
#define VADC_G7_SRACT /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SRACT*)0xF00221C8u)

/** Alias (User Manual Name) for VADC_G7_SRACT.
* To use register names with standard convension, please use VADC_G7_SRACT.
*/
#define	VADC_G7SRACT	(VADC_G7_SRACT)

/** \brief  20C0, Synchronization Control Register, Group */
#define VADC_G7_SYNCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_SYNCTR*)0xF00220C0u)

/** Alias (User Manual Name) for VADC_G7_SYNCTR.
* To use register names with standard convension, please use VADC_G7_SYNCTR.
*/
#define	VADC_G7SYNCTR	(VADC_G7_SYNCTR)

/** \brief  21F8, Valid Flag Register, Group */
#define VADC_G7_VFR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_VFR*)0xF00221F8u)

/** Alias (User Manual Name) for VADC_G7_VFR.
* To use register names with standard convension, please use VADC_G7_VFR.
*/
#define	VADC_G7VFR	(VADC_G7_VFR)

/** \brief  B8, Global Boundary Select Register */
#define VADC_GLOBBOUND /*lint --e(923)*/ (*(volatile Ifx_VADC_GLOBBOUND*)0xF00200B8u)

/** \brief  80, Global Configuration Register */
#define VADC_GLOBCFG /*lint --e(923)*/ (*(volatile Ifx_VADC_GLOBCFG*)0xF0020080u)

/** \brief  E0, Global Event Flag Register */
#define VADC_GLOBEFLAG /*lint --e(923)*/ (*(volatile Ifx_VADC_GLOBEFLAG*)0xF00200E0u)

/** \brief  140, Global Event Node Pointer Register */
#define VADC_GLOBEVNP /*lint --e(923)*/ (*(volatile Ifx_VADC_GLOBEVNP*)0xF0020140u)

/** \brief  A0, Input Class Register */
#define VADC_GLOBICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00200A0u)

/** \brief  A4, Input Class Register */
#define VADC_GLOBICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00200A4u)

/** \brief  280, Global Result Control Register */
#define VADC_GLOBRCR /*lint --e(923)*/ (*(volatile Ifx_VADC_GLOBRCR*)0xF0020280u)

/** \brief  300, Global Result Register */
#define VADC_GLOBRES /*lint --e(923)*/ (*(volatile Ifx_VADC_GLOBRES*)0xF0020300u)

/** \brief  380, Global Result Register, Debug */
#define VADC_GLOBRESD /*lint --e(923)*/ (*(volatile Ifx_VADC_GLOBRESD*)0xF0020380u)

/** \brief  160, Global Test Functions Register */
#define VADC_GLOBTF /*lint --e(923)*/ (*(volatile Ifx_VADC_GLOBTF*)0xF0020160u)

/** \brief  8, Module Identification Register */
#define VADC_ID /*lint --e(923)*/ (*(volatile Ifx_VADC_ID*)0xF0020008u)

/** \brief  34, Kernel Reset Register 0 */
#define VADC_KRST0 /*lint --e(923)*/ (*(volatile Ifx_VADC_KRST0*)0xF0020034u)

/** \brief  30, Kernel Reset Register 1 */
#define VADC_KRST1 /*lint --e(923)*/ (*(volatile Ifx_VADC_KRST1*)0xF0020030u)

/** \brief  2C, Kernel Reset Status Clear Register */
#define VADC_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_VADC_KRSTCLR*)0xF002002Cu)

/** \brief  28, OCDS Control and Status Register */
#define VADC_OCS /*lint --e(923)*/ (*(volatile Ifx_VADC_OCS*)0xF0020028u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXVADC_REG_H */
